Autodesk.Revit.DB.RevitLinkType.UpdateLinkExternalResourceReference(Autodesk.Revit.DB.ExternalResourceReference)
since 2027
Updates the Revit link from an external resource reference
Internal only
Used for removing the Scenario properties from ExternalResourceReference
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support Revit links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.RevitLinkType.IsScenarioBasedRevitLink
Checks whether a RevitLinkType originates from a scenario (linked from a Forma scenario).
Remarks:
Scenario-based Revit links are created through the Forma scenario connection
and have the ScenarioModelId property in their ExternalResourceReference.
Operations such as load, reload, loadFrom, unload, unloadLocally, setPathType,
setAttachmentType, savePositions, and revertLocalUnloadStatus are blocked for
scenario-based Revit links because their lifecycle is tied to the scenario connection.
Returns:
True if the RevitLinkType originates from a scenario; false otherwise.
Since:
2027

Autodesk.Revit.DB.RevitLinkType.IsNotScenarioBasedRevitLink
Checks whether a RevitLinkType does not originate from a scenario.
Used as a validator to block operations on scenario-based Revit links.
Returns:
True if the RevitLinkType does not originate from a scenario; false otherwise.
Since:
2027

Autodesk.Revit.DB.RevitLinkType.ReloadForScenarioSync
Reloads the Revit link for scenario synchronization operations.
Remarks:
This method is intended for internal use by the scenario synchronization system (FormaOpenIn).
It allows reloading scenario-based Revit links, which is blocked for the public Reload() API.
This method should only be called by the scenario sync feature to update links when
the scenario source has changed.
If the link is currently loaded, Revit must unload the link before reloading it.
Any changes made in-memory to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors which occurred while trying to load.
LinkLoadResultType.LinkLoaded indicates success.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This RevitLinkType is not a top-level link.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2027

Autodesk.Revit.DB.RevitLinkType.UnloadLocally(Autodesk.Revit.DB.ISaveSharedCoordinatesCallbackForUnloadLocally)
Unloads a Revit link for the current user only.
Remarks:
This function unloads the Revit link for the current user,
instead of all users, in the workshared files.
If you want to unload the Revit link for all users, please use Autodesk.Revit.DB.RevitLinkType.Unload(Autodesk.Revit.DB.ISaveSharedCoordinatesCallback).
This function should not be called on a Revit link:
in a document which is in an edit mode or is in family mode.
in a document which is in dynamic update.
in a document which is read only.
in a document in which there is transaction phase left open.
in a non-workshared file.
in a central model of workshared file.
which is nested.
which is unloaded locally already.
This operation is blocked for Revit links that originate from a scenario.
Scenario-based Revit links cannot be unloaded locally as their lifecycle is tied to the scenario connection.
callback:
A callback indicating what to do if Revit encounters
links which have changes in shared coordinates. The saving options for
unloading locally  only could be: save the link, not save the link.
If null, Revit will not save any shared coordinates
changes to the link before unloading.
Returns:
Returns true if the attempt to unload the link locally was successful.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This functionality is not available in Revit LT.
-or-
The element "this RevitLinkType" is in non-workshared document.
-or-
The element "this RevitLinkType" is not in a local model: the model is not workshared or it is central.
-or-
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is locally unloaded for current user already.
-or-
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2016 Subscripton Update

Autodesk.Revit.DB.RevitLinkType.SavePositions(Autodesk.Revit.DB.ISaveSharedCoordinatesCallback)
Saves shared coordinates changes back to the linked document.
Remarks:
While this operation does not clear the document's undo history,
you will not be able to undo this specific action, since it saves
the link's shared coordinates changes to disk.
This operation is blocked for Revit links that originate from a scenario.
Modifications to link positions or shared coordinates cannot be persisted to scenario-based Revit links.
callback:
A callback object to resolve situations when Revit encounters
modified links.
Returns:
True if we saved the link or if there were no changes to save.
False if the operation failed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
Revit could not save shared coordinates changes to the link
or one of its nested links.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.Unload(Autodesk.Revit.DB.ISaveSharedCoordinatesCallback)
Unloads the Revit link.
Remarks:
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
This operation is blocked for Revit links that originate from a scenario.
Scenario-based Revit links cannot be unloaded independently as their lifecycle is tied to the scenario connection.
callback:
A callback indicating what to do if Revit encounters
links which have changes in shared coordinates.
If null, Revit will not save any shared coordinates
changes to the link before unloading.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
Revit could not save shared coordinates changes to the link
or one of its nested links.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot link a cloud model to non-cloud model
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that failed on service side.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud model.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.LoadFrom(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.WorksetConfiguration)
Loads or reloads the Revit link from disk or cloud.
The link will be loaded from the input path.
Remarks:
The input path must be absolute. Revit will store
an absolute or relative path internally, according
to the link's settings. Revit Server paths or cloud paths are acceptable.
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
Revit does not try to validate that the input path
represents the "same" document. You can load a
completely different document, which may invalidate
references to linked elements.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
This operation is blocked for Revit links that originate from a scenario.
Scenario-based Revit links cannot have their path changed as their source is managed by the scenario system.
path:
A ModelPath indicating where to load the link from.
This may be a path of local disk, Revit Server or Cloud.
This must be an absolute path for local path.
config:
A WorksetConfiguration object indicating which worksets in the
link to open.
If you want to load the same set of worksets the link previously
had, leave this argument as null.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors
which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input path "path" does not represent a Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
The model is not allowed to access.
-or-
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot customize worksets for this model.
-or-
Revit cannot link a cloud model to non-cloud model.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that failed on service side.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud model.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.LoadFrom(Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.WorksetConfiguration)
Loads or reloads the Revit link.
The link will be loaded from the location given in the
input ExternalResourceReference.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
Revit does not try to validate that the input
represents the "same" document. You can load a
completely different document, which may invalidate
references to linked elements.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
This operation is blocked for Revit links that originate from a scenario.
Scenario-based Revit links cannot have their resource reference changed as their source is managed by the scenario system.
resourceReference:
An external resource reference describing the source of the linked Revit document.
config:
A WorksetConfiguration object indicating which worksets in the
link to open.
If you want to load the same set of worksets the link previously
had, leave this argument as null.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors
which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support Revit links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot customize worksets for this model.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.RevertLocalUnloadStatus
Restores the workshared load status of a link that has been unloaded only for the current user,
in a local copy of a workshared model.
Remarks:
This function removes the local user's override of the link's workshared load status
(see UnloadLocally method).  That is, if the link is loaded in the central model for
all worksharing users (and thus has been only unloaded for the local user), then this
method will perform a full reload of the link for the local user.  If the link is
unloaded in the central model, then this method will simply clear the local user's
unload override, so that the link will be reloaded in the local user's model,
if it is ever reloaded in the central model.
This function should not be called on a Revit link:
in a document which is in an edit mode or is in family mode.
in a document which is in dynamic update.
in a document which is read only.
in a document in which there is transaction phase left open.
in a non-workshared file.
in a central model of workshared file.
which is nested.
which are not locally unloaded.
If the link is an external resource, Revit will contact the IExternalResourceServer
to get the latest version of the link.
This operation is blocked for Revit links that originate from a scenario.
Scenario-based Revit links cannot have their unload status reverted as their lifecycle is tied to the scenario connection.
Returns:
The link's LinkedFileStatus that has resulted from reverting the local unloaded status.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This functionality is not available in Revit LT.
-or-
The element "this RevitLinkType" is in non-workshared document.
-or-
The element "this RevitLinkType" is not in a local model: the model is not workshared or it is central.
-or-
This RevitLinkType is not a top-level link.
-or-
The link is not locally unloaded.
-or-
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2016 Subscription Update

Autodesk.Revit.DB.RevitLinkType.Reload
Loads or reloads the Revit link from its
currently-stored location. If the link is an
external resource, Revit will contact the
IExternalResourceServer to get the latest version
of the link.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
This function is identical to RevitLinkType.Load() and is included for
convenience.
This operation is blocked for Revit links that originate from a scenario.
Scenario-based Revit links cannot be reloaded independently as their source is managed by the scenario system.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
LinkLoadResultType.LinkLoaded indicates
success.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.Load
Loads or reloads the Revit link from its
currently-stored location. If the link is an
external resource, Revit will contact the
IExternalResourceServer to get the latest version
of the link.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
This operation is blocked for Revit links that originate from a scenario.
Scenario-based Revit links cannot be reloaded independently as their source is managed by the scenario system.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
LinkLoadResultType.LinkLoaded indicates
success.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.AttachmentType
The attachment/overlay status of this link.
Remarks:
"Attachment" links are considered to be part of their parent
link and will be brought along if their parent is linked into
another document. "Overlay" links are only visible when their
parent is open directly.
For example: A user has a file B which contains a link C, and
they wish to link B into another file, A. If C is an overlay, C
will not be loaded into A. If C is an attachment, then C will
be loaded into A along with B.
Setting this property is blocked for Revit links that originate from a scenario.
Scenario-based Revit links are read-only and cannot have their attachment type changed.
AttachmentType.Overlay if this link is an overlay,
AttachmentType.Attachment if this link is an attachment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This RevitLinkType is not a top-level link.
-or-
When setting this property: This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
Since:
2012

Autodesk.Revit.DB.RevitLinkType.PathType
The type of path the link uses.
Remarks:
You cannot change the PathType to or from PathType.Server. The
path type will change automatically if you call RevitLinkType.LoadFrom
with a Revit Server path.
Links from external resource servers are considered to have no path
type. Attempts to access this property for an external server link
will result in an exception.
Setting this property is blocked for Revit links that originate from a scenario.
Scenario-based Revit links are read-only and cannot have their path type changed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The PathType of the Revit link cannot be determined (or set), because it was
not loaded from a local disk drive or from Revit Server.
-or-
When setting this property: The PathType for the link is not valid. PathType.Content is never
valid for a Revit link. To change the type to or from PathType.Server,
use RevitLinkType.LoadFrom and pick a server or file path.
-or-
When setting this property: This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
Since:
2014